import React from "react";
import Layout from "../../components/Layout/Layout";
import { motion } from "framer-motion";

const About = () => {
  return (
    <Layout>
      <div className="default-container">
        <div className="flex flex-col justify-center items-center">
          <div className="flex items-center justify-center my-5">
            <p className="font-bold text-secondary  border-b-4 border-b-orange-300 mb-7 text-xl  max-w-[120px] text-center ">
              תנאי שימוש{" "}
            </p>
          </div>
          <motion.p
            className="text-secondary mb-10 max-w-[1000px]"
            initial={{ opacity: 0 }}
            animate={{ opacity: 1 }}
            transition={{ duration: 0.7 }}
          >
            <p className="font-bold"> תנאי שימוש ב&quot;אנציקלופרח&quot;</p>
            <p className="mt-2 mb-2 mr-6"> 1. קדימון </p>
            תקנון השימוש באתר הנ&quot;ל נכתב בלשון זכר אך האמור בו מתייחס לנשים
            וגברים כאחד . אתר &quot;אנציקלופרח&quot; (להלן &quot;האתר&quot;) הוא
            אתר המשתמש כמנוע לחיפוש, הגדרה וזיהוי של צמחים, כמו גם אתר שיתופי
            לאספקה, יצירה ושיתוף של מידע אודות, צמחים, איזורים גיאוגרפיים, בתי
            גידול, אירועים ועוד. השימוש באתר הינו בכפוף לקריאת תנאי השימוש. כל
            שימוש באתר מהווה הסכמה לתנאי השימוש. בנוסף השימוש באתר זה על כל
            תכניו והשירותים המוצעים בו, הורדות של קבצים, מדיה כגון תמונות
            וסרטונים והתכנים השונים המוצעים לקהל המבקרים עשויים להשתנות מעת לעת
            או בהתאם לסוג התוכן. הנהלת האתר שומרת לעצמה הזכות לעדכן את תנאי
            השימוש המוצגים להלן מעת לעת וללא התראה או אזכור מיוחד בערוצי האתר
            השונים.
            <p className="mt-2 mb-2 mr-6"> 2. תוכן האתר </p>
            אנו שואפים לספק לכם את המידע המוצג באתר ללא הפרעות אך יתכנו בשל
            שיקולים טכניים, תקלות צד ג או אחרים, הפרעות בזמינות האתר. ולכן איננו
            יכולים להתחייב כי האתר יהיה זמין לכם בכל עת ולא יינתן כל פיצוי כספי
            או אחר בשל הפסקת השירות/הורדת האתר. קישורים לאתרים חיצוניים הנמצאים
            באתר אינם מהווים ערובה כי מדובר באתרים בטוחים, איכותיים או אמינים
            וביקור בהם נעשה על דעתכם האישית בלבד ונמצאים בתחום האחריות הבלעדי של
            המשתמש באתר. מהימנות המידע באתר &quot;אנציקלופרח&quot; איננה באיכות
            הגבוהה ביותר, ויש לקחת את המידע באתר בעירבון מוגבל. אין צוות האתר
            אחראיים לכל נזר שיגרם בגין שימוש במידע מן האתר על ידי משתמש.
            <p className="mt-2 mb-2 mr-6"> 3. ניהול משתמשים ומבקרים באתר </p>
            הנהלת האתר שומרת לעצמה את הזכות לחסום כל משתמש ובין אם על ידי חסימת
            כתובת ה IP של המחשב שלו, כתובת ה MACID של המחשב שלו או אפילו בהתאם
            למדינת המוצא ללא צורך לספק תירוץ אשר מקובל על הגולש. צוות האתר /
            הנהלת האתר יעשה כל שביכולתו להגן על פרטי המשתמשים הרשומים
            באתר/מנויים הרשומים באתר. אף על פי כן במקרים בהם יעלה בידיו של צד
            שלישי להשיג גישה למידע, מוסכם בזאת כי לגולשים, משתמשים וחברים באתר
            לא תהה כל תביעה, טענה או דרישה כלפי צוות האתר
            &quot;אנציקלופרח&quot;.
            <p className="mt-2 mb-2 mr-6"> 4. גילוי נאות </p>
            על מנת ליעל את פונקציות האתר ולשפר את חווית המשתמש, באתר זה עשוי
            להיות שימוש בממשקי סטטיסטיקה פנימיים בכדי לשמר תיעוד סטטיסטי אנונימי
            של גולשים ולנתח תנועת גולשים, הרגלי גלישה, ניתוח קליקים וזמן שהייה.
            בכל העת ולבד מאשר גולשים המחוברים לאתר, המידע הנשמר הוא אנונימי
            לחלוטין ואין בו את שם הגולש או כל פרט מזהה אחר.
            <p className="mt-2 mb-2 mr-6"> 5. רישום משתמשים </p>
            משתמש הנרשם לאתר מסכים בסאת לקבל כתבות ועדכונים לדואר האלקטרוני
            הפרטי שלו. בכל עת ניתן יהיה למשתמש להסיר עצמו מרשימת התפוצה ובזאת
            לחדול את קבלת המסרים לכתובת המייל.
            <p className="mt-2 mb-2 mr-6"> 6. איזור שיפוט </p>
            בעת שאתם עושים שימוש באתר ובמקרה בו התגלעה כל מחולקת אתם מסכימים
            להלן כי האמור לעיל נמצא תחת סמכות השיפוט הבלעדי של החוק הישראלי תוך
            שימוש במערכת בתי המשפט הישראליים בלבד במחוז צפון.
          </motion.p>
        </div>
      </div>
    </Layout>
  );
};

export default About;
