from typing import Literal
from enum import Enum


class LocationCommonEnum(str, Enum):
    a = "נפוץ"
    b = "מצוי"
    c = "נדיר"
    d = "נדיר מאוד"
    e = "שכיחות לא ידועה"


COLORS = Literal[
    "ירוק",
    "בורדו",
    "ורוד",
    "תכלת",
    "לבן",
    "סגול",
    "אדום",
    "קרם",
    "צהוב",
    "חום",
    "כתום",
    "שחור",
    "כחול",
    "מנומר",
    "ללא פרח",
    "ללא עטיף - ללא עלי כותרת",
]

PETALS = Literal[
    "חסר עלי כותרת",
    "6",
    "5",
    "מאוחה",
    "4",
    "3",
    "רבים",
]

LEAF_SHAPES = Literal[
    "פשוט",
    "סרגלי",
    "מחולק לאונות",
    "קשקש",
    "מחטני",
    "דמוי לב",
    "דמוי גליל",
    "מורכב",
    "מאוצבע",
    "תלתני",
    "גזור",
    "גזור פעמיים או יותר",
    "מנוצה",
    "מנוצה פעמיים או יותר",
    "אין עלים",
]


LEAF_EDGES = Literal[
    "תמימה",
    "מפורצת",
    "משוננת או מסורית",
    "אחרת",
]

LEAF_ARRANGEMENTS = Literal[
    "מסורגים (עלה אחד בכל מפרק)",
    "שושנת עלים",
    "נגדיים (שני עלים בכל מפרק)",
    "ערוכים בדורים",
]

STEM_SHAPES = Literal[
    "עגול",
    "מצולע",
    "חסר גבעול",
    "מרובע",
    "משולש",
]


LIFE_FORMS = Literal[
    "חד-שנתי",
    "גיאופיט (בצל או פקעת)",
    "עשבוני רב-שנתי",
    "שיח",
    "בן-שיח",
    "מטפס",
    "עץ",
    "צמח מים",
    "טפיל",
    "שרכים",
    "דו-שנתי",
    "טחבים",
]

HABITATS = Literal[
    "חולות",
    "קרקעות קלות",
    "בתות",
    "בתות של הרים גבוהים",
    "חברות שיחים",
    "ערבות-שיחים",
    "קרקעות כבדות",
    "בתי גידול לחים",
    "מדבר",
    "מחשופי סלע קשה",
    "קירות וחומות",
    "סביבות חמות - צמחים אוהבי חום",
    "קרקעות מלוחות",
    "חורש",
    "בתה עשבונית ים-תיכונית",
    "נטע אדם",
    "שטחים מופרים",
    "שדות ושטחים מעובדים",
    "יער",
    "חוף הים התיכון",
    "קרקעות עשירות בנוטריינטים",
    "מחשופי סלע מוצלים",
    "יער ספר הררי",
    "בתות טרגקנטיות של הרים גבוהים",
]

SEX_FLOWER = Literal[
    "פרחים דו-מיניים וחד-מיניים (צמח פוליגמי)",
    "פרחים דו-מיניים בלבד",
    "פרחים אבקניים ופרחים עלייניים (צמח חד-ביתי)",
    "פרחים אבקניים או עליינים (צמח דו-ביתי)",
    "רבייה על-ידי נבגים",
    "איצטרובלים זכריים ונקביים (צמח חד-ביתי)",
    "איצטרובלים זכריים או נקביים (צמח דו-ביתי)",
]


SPINE = Literal[
    "ענפים",
    "עלים",
    "גבעולים",
    "פירות",
    "פרחים",
]
